Repository: DemerNkardaz/SDeleteGUI
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru

# AppWindowTitle
source: Secure Delete Interface
ru_ru: Интерфейс безопасного удаления

# FileDeletionTab.Header
source: File deletion
ru_ru: Удаление файлов

# CleanFreeSpaceTab.Header
source: Clean free space
ru_ru: Очистка свободного места

# PathsHeader.Text
source: Paths
ru_ru: Пути

# EmptyPathsHint.Text
source: No paths added
ru_ru: Пути не добавлены

# AddFilesButton.Content
source: Add file(s)
ru_ru: Добавить файл(ы)

# AddFolderButton.Content
source: Add folder
ru_ru: Добавить папку

# ClearPathsButton.Content
source: Clear
ru_ru: Очистить

# RecurseCheckBox.Content
source: Recursive
ru_ru: Рекурсивно

# RemoveReadOnlyCheckBox.Content
source: Clear read-only attribute
ru_ru: Снимать атрибут «только для чтения»

# DropToAddCaption
source: Add to deletion list
ru_ru: Добавить в список удаления

# DrivesHeader.Text
source: Drives and devices
ru_ru: Диски и устройства

# RefreshDrivesButton.Content
source: Refresh
ru_ru: Обновить

# CleanModeLabel.Text
source: Clean mode:
ru_ru: Режим очистки:

# ZeroFillRadio.Content
source: Zero fill
ru_ru: Заполнить нулями

# CleanFreeRadio.Content
source: Clean
ru_ru: Очистить

# Use64BitCheckBox.Content
source: 64-bit version
ru_ru: 64-битная версия

# PassesLabel.Text
source: Passes:
ru_ru: Проходов:

# SdeleteFolderLabel.Text
source: SDelete Directory:
ru_ru: Директория с SDelete:

# SdeleteFolderTextBox.PlaceholderText
source: Leave empty if SDelete is in PATH
ru_ru: Оставьте пустым, если SDelete есть в PATH

# BrowseSdeleteFolderButton.Content
source: Browse...
ru_ru: Обзор…

# ConfirmDialog.Title
source: Confirmation
ru_ru: Подтверждение

# ConfirmDialog.PrimaryButtonText
source: Yes
ru_ru: Да

# ConfirmDialog.CloseButtonText
source: No
ru_ru: Нет

# RunButton
source: Run
ru_ru: Запустить

# StopButton
source: Interrupt
ru_ru: Прервать

source: Local disk
ru_ru: Локальный диск

# ContentsOnlyCheckBox
source: Contents only
ru_ru: Только содержимое

# ChangePathButton
source: Change
ru_ru: Изменить

# ValidationPassesTooSmall
source: Passes count must be at least 1.
ru_ru: Число проходов должно быть не меньше 1.

# ValidationNoPaths
source: Add at least one path to delete.
ru_ru: Добавьте хотя бы один путь для удаления.

# ValidationNoDrives
source: Select at least one drive.
ru_ru: Выберите хотя бы один диск.

source: Command cannot be built:
ru_ru: Команда не может быть сформирована:

# CommandBuildInternalError
source: [Internal error while building the command]
ru_ru: [Внутренняя ошибка при построении команды]

# ConfirmDialogDeleteFilesText
source: Running this command will irreversibly destroy the selected files and folders. Even with file recovery tools you will not be able to restore them. Do you want to continue?
ru_ru: Запуск данной команды необратимо уничтожит выбранные файлы и папки. Даже используя инструменты восстановления удалённых файлов вы не сможете их восстановить. Хотите продолжить?

# ConfirmDialogCleanFreeSpaceText
source: Running this command will start cleaning free space on the selected drives. Depending on the drive size and the amount of free space, the process may take a long time, up to 10 hours or more. During this time, do not use the selected drives. Secure deletion will temporarily fill all free space on them. Note: If the operation is interrupted, temporary files may remain on the disk, occupying all free space. They will have to be deleted manually (usually files named SDELTEMP, SDELMFT in the root of the disk). The files may be hidden. Do you want to continue?
ru_ru: Запуск данной команды запустит процесс очистки свободного места на выбранных накопителях. В зависимости от объёма накопителя и размера свободного места, процесс может занять длительное время, вплоть до 10 часов и более. В течение этого времени не используйте выбранные накопители. Безопасное удаление временно заполнит всё свободное место на них. Примечание: Если операция будет прервана, на диске могут остаться временные файлы, занимающие всё свободное место. Их нужно будет удалить вручную (обычно это файлы с именами SDELTEMP, SDELMFT в корне диска). Файлы могут быть скрытым. Хотите продолжить?

# ConfirmDialogYesCountdown
source: Yes ({0})
ru_ru: Да ({0})

# ConfirmDialogYes
source: Yes
ru_ru: Да

# CloseWhileRunningTitle
source: Process is running
ru_ru: Процесс выполняется

# CloseWhileRunningText
source: SDelete is still running. If you close the window, the process will be interrupted. This may leave temporary files on the disk. Do you want to stop and exit?
ru_ru: SDelete ещё работает. Если вы закроете окно, процесс будет прерван. Это может оставить временные файлы на диске. Хотите прервать и выйти?

# CloseWhileRunningYes
source: Stop and exit
ru_ru: Прервать и выйти

# CloseWhileRunningNo
source: Stay
ru_ru: Остаться

source: SDelete not found
ru_ru: Не удалось найти исполняемый файл SDelete

# RunCommandStarted
source: ~ Command started
ru_ru: ~ Запуск команды

# RunCommandCompleted
source: ~ Completed with exit code {0}
ru_ru: ~ Завершено с кодом {0}

# RunCommandError
source: ~ Launch error: {0}
ru_ru: ~ Ошибка запуска: {0}

# OpenPathToolTip
source: Show in Explorer
ru_ru: Показать в Проводнике

# BlockedPathsTitle
source: Path not added
ru_ru: Путь не добавлен

# BlockedPathsText
source: System and critical system folders or files cannot be added to the deletion list
ru_ru: Невозможно добавить системные/критически значимые для работы системы папки или файлы в список на удаление

# BlockedPathsMore
source: …and {0} more
ru_ru: …и ещё {0}

# DriveTypeNetwork
source: Net
ru_ru: Сеть

# FlashWarningTitle
source: Warning
ru_ru: Предупреждение

# FlashWarningText
source: You have selected {0} storage. Using SDelete on such drives does not guarantee that data is destroyed. Wiping the drive may significantly accelerate the wear of {0} storage.
ru_ru: Вы выбрали {0}-накопитель. Использование SDelete на таких накопителях не гарантирует уничтожение данных. Очистка диска может значительно ускорить износ {0}-накопителя.

# PathsStats
source: {0} files · {1} folders · {2}
ru_ru: Файлов: {0} · Папок: {1} · {2}

# PathsStatsCounting
source: Counting… {0} files · {1} folders · {2}
ru_ru: Подсчёт… файлов: {0} · папок: {1} · {2}

# PathsStatsStopped
source: Count stopped: {0} files · {1} folders · {2} (partial)
ru_ru: Подсчёт прерван: файлов {0} · папок {1} · {2} (неполные данные)

# UnitB
source: B
ru_ru: Б

# UnitKB
source: KB
ru_ru: КБ

# UnitTB
source: TB
ru_ru: ТБ

# UnitGB
source: GB
ru_ru: ГБ

# UnitMB
source: MB
ru_ru: МБ

# AuthorName
source: Yalla Nkardaz
ru_ru: Ялла Нкардаз
